In [5]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import scipy as sp
import scipy.stats as stats

In [6]:
df = pd.read_csv("fb.csv")

In [7]:
df

,userid,age,dob_day,dob_year,dob_month,gender,tenure,friend_count,friendships_initiated,likes,likes_received,mobile_likes,mobile_likes_received,www_likes,www_likes_received
0,2094382,14,19,1999,11,male,266.0,0,0,0,0,0,0,0,0
1,1192601,14,2,1999,11,female,6.0,0,0,0,0,0,0,0,0
2,2083884,14,16,1999,11,male,13.0,0,0,0,0,0,0,0,0
3,1203168,14,25,1999,12,female,93.0,0,0,0,0,0,0,0,0
4,1733186,14,4,1999,12,male,82.0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
98998,1268299,68,4,1945,4,female,541.0,2118,341,3996,18089,3505,11887,491,6202
98999,1256153,18,12,1995,3,female,21.0,1968,1720,4401,13412,4399,10592,2,2820
99000,1195943,15,10,1998,5,female,111.0,2002,1524,11959,12554,11959,11462,0,1092
99001,1468023,23,11,1990,4,female,416.0,2560,185,4506,6516,4506,5760,0,756
99002,1397896,39,15,1974,5,female,397.0,2049,768,9410,12443,9410,9530,0,2913

In [8]:
df.columns

Index(['userid', 'age', 'dob_day', 'dob_year', 'dob_month', 'gender', 'tenure',
       'friend_count', 'friendships_initiated', 'likes', 'likes_received',
       'mobile_likes', 'mobile_likes_received', 'www_likes',
       'www_likes_received'],
      dtype='object')

In [9]:
print(f"The Number of Rows are {df.shape[0]}, and columns are {df.shape[1]}.")

The Number of Rows are 99003, and columns are 15.

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99003 entries, 0 to 99002
Data columns (total 15 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   userid                 99003 non-null  int64
 1   age                    99003 non-null  int64
 2   dob_day                99003 non-null  int64
 3   dob_year               99003 non-null  int64
 4   dob_month              99003 non-null  int64
 5   gender                 98828 non-null  object
 6   tenure                 99001 non-null  float64
 7   friend_count           99003 non-null  int64
 8   friendships_initiated  99003 non-null  int64
 9   likes                  99003 non-null  int64
 10  likes_received         99003 non-null  int64
 11  mobile_likes           99003 non-null  int64
 12  mobile_likes_received  99003 non-null  int64
 13  www_likes              99003 non-null  int64
 14  www_likes_received     99003 non-null  int64
dtypes: float64(1), int64(13), object(1)
memory usage: 11.3+ MB

In [11]:
# We can see that above data is already has Data type , doesn't require any changes.

In [12]:
df.isnull().sum()

userid                     0
age                        0
dob_day                    0
dob_year                   0
dob_month                  0
gender                   175
tenure                     2
friend_count               0
friendships_initiated      0
likes                      0
likes_received             0
mobile_likes               0
mobile_likes_received      0
www_likes                  0
www_likes_received         0
dtype: int64

data does not consist of any symbols , which is good thing as it not require any more data cleaning at cell level
but we can see there are empty value which can effect the Model learning

In [13]:
df.head()

,userid,age,dob_day,dob_year,dob_month,gender,tenure,friend_count,friendships_initiated,likes,likes_received,mobile_likes,mobile_likes_received,www_likes,www_likes_received
0,2094382,14,19,1999,11,male,266.0,0,0,0,0,0,0,0,0
1,1192601,14,2,1999,11,female,6.0,0,0,0,0,0,0,0,0
2,2083884,14,16,1999,11,male,13.0,0,0,0,0,0,0,0,0
3,1203168,14,25,1999,12,female,93.0,0,0,0,0,0,0,0,0
4,1733186,14,4,1999,12,male,82.0,0,0,0,0,0,0,0,0

In [14]:
#concating the Date of birth columns
df['DOB'] = df.apply(lambda x:'%s-%s-%s' % (x['dob_day'],x['dob_month'],x['dob_year']),axis=1)
df['DOB'] = pd.to_datetime(df['DOB']) # Changing the data type

C:\Users\tempu\AppData\Local\Temp\ipykernel_7756\2392401567.py:3: UserWarning: Parsing dates in %d-%m-%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  df['DOB'] = pd.to_datetime(df['DOB']) # Changing the data type

In [15]:
df['DOB'].dtype

dtype('<M8[ns]')

In [16]:
pd.set_option('display.max_row', None)

#For checking we are not getting invalid data
print(df['age'].value_counts())

age
18     5196
23     4404
19     4391
20     3769
21     3671
25     3641
17     3283
16     3086
22     3032
24     2827
26     2815
15     2618
28     2364
27     2240
33     1999
29     1936
14     1925
30     1716
31     1694
108    1661
32     1443
34     1257
53     1192
35     1175
36     1118
38     1099
43     1063
103    1044
52      995
51      971
37      969
50      966
49      951
54      951
57      932
55      925
63      907
39      902
47      902
48      896
58      893
56      878
44      877
46      851
68      846
42      835
40      835
59      834
61      832
45      826
41      801
60      748
62      736
64      709
66      703
65      693
67      604
13      484
69      460
70      365
71      352
73      330
100     325
72      296
74      281
75      233
93      203
113     202
102     187
94      184
76      178
77      169
78      162
101     157
83      152
80      136
106     125
79      112
81      108
107      98
98       93
84       86
99       83
85       83
105      80
82       78
95       77
91       76
86       76
104      73
90       71
96       70
88       61
89       60
97       56
92       52
87       42
112      18
111      18
110      15
109       9
Name: count, dtype: int64

It is Hard to trust the data where age of above 80 are able to understand and use technology for be on Face book.

In [17]:
print(df['gender'].value_counts())

gender
male      58574
female    40254
Name: count, dtype: int64

In [18]:
df.dropna(inplace = True) #droping the rows in for the values are null ,  as we have large data set it will not effect much on out come.

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 98826 entries, 0 to 99002
Data columns (total 16 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   userid                 98826 non-null  int64
 1   age                    98826 non-null  int64
 2   dob_day                98826 non-null  int64
 3   dob_year               98826 non-null  int64
 4   dob_month              98826 non-null  int64
 5   gender                 98826 non-null  object
 6   tenure                 98826 non-null  float64
 7   friend_count           98826 non-null  int64
 8   friendships_initiated  98826 non-null  int64
 9   likes                  98826 non-null  int64
 10  likes_received         98826 non-null  int64
 11  mobile_likes           98826 non-null  int64
 12  mobile_likes_received  98826 non-null  int64
 13  www_likes              98826 non-null  int64
 14  www_likes_received     98826 non-null  int64
 15  DOB                    98826 non-null  datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(13), object(1)
memory usage: 12.8+ MB

We will be removing the rows of data for which age is above 80 , beacuse it is a for loop it will take some time to excetute

In [20]:
for x in df.index:
  if df.loc[x, "age"] > 80:
    df.drop(x, inplace = True)

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 93182 entries, 0 to 99002
Data columns (total 16 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   userid                 93182 non-null  int64
 1   age                    93182 non-null  int64
 2   dob_day                93182 non-null  int64
 3   dob_year               93182 non-null  int64
 4   dob_month              93182 non-null  int64
 5   gender                 93182 non-null  object
 6   tenure                 93182 non-null  float64
 7   friend_count           93182 non-null  int64
 8   friendships_initiated  93182 non-null  int64
 9   likes                  93182 non-null  int64
 10  likes_received         93182 non-null  int64
 11  mobile_likes           93182 non-null  int64
 12  mobile_likes_received  93182 non-null  int64
 13  www_likes              93182 non-null  int64
 14  www_likes_received     93182 non-null  int64
 15  DOB                    93182 non-null  datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(13), object(1)
memory usage: 14.1+ MB

In [22]:
df['age'] = pd.to_numeric(df['age'], downcast="integer")

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 93182 entries, 0 to 99002
Data columns (total 16 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   userid                 93182 non-null  int64
 1   age                    93182 non-null  int8
 2   dob_day                93182 non-null  int64
 3   dob_year               93182 non-null  int64
 4   dob_month              93182 non-null  int64
 5   gender                 93182 non-null  object
 6   tenure                 93182 non-null  float64
 7   friend_count           93182 non-null  int64
 8   friendships_initiated  93182 non-null  int64
 9   likes                  93182 non-null  int64
 10  likes_received         93182 non-null  int64
 11  mobile_likes           93182 non-null  int64
 12  mobile_likes_received  93182 non-null  int64
 13  www_likes              93182 non-null  int64
 14  www_likes_received     93182 non-null  int64
 15  DOB                    93182 non-null  datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(12), int8(1), object(1)
memory usage: 13.5+ MB

In [24]:
df.describe()

,userid,age,dob_day,dob_year,dob_month,tenure,friend_count,friendships_initiated,likes,likes_received,mobile_likes,mobile_likes_received,www_likes,www_likes_received,DOB
count,9.318200e+04,93182.000000,93182.000000,93182.000000,93182.000000,93182.00000,93182.000000,93182.000000,93182.000000,93182.000000,93182.000000,93182.000000,93182.000000,93182.000000,93182
mean,1.597326e+06,33.353974,14.523706,1979.646026,6.285624,502.57597,185.342598,103.002050,156.390805,143.568822,106.797987,84.385708,49.592765,59.183072,1980-02-14 19:06:08.028159936
min,1.000008e+06,13.000000,1.000000,1933.000000,1.000000,0.00000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1933-01-01 00:00:00
25%,1.299138e+06,20.000000,7.000000,1968.000000,3.000000,220.00000,29.000000,16.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1968-07-01 00:00:00
50%,1.596340e+06,27.000000,14.000000,1986.000000,6.000000,397.00000,78.000000,44.000000,10.000000,8.000000,4.000000,4.000000,0.000000,2.000000,1986-04-25 00:00:00
75%,1.896225e+06,45.000000,22.000000,1993.000000,9.000000,634.00000,194.000000,111.000000,79.000000,57.000000,45.000000,32.000000,6.000000,19.000000,1993-05-17 00:00:00
max,2.193542e+06,80.000000,31.000000,2000.000000,12.000000,2592.00000,4917.000000,4144.000000,25111.000000,261197.000000,25111.000000,138561.000000,14865.000000,129953.000000,2000-10-27 00:00:00
std,3.441139e+05,16.530006,8.990649,16.530006,3.522300,420.18562,370.382207,184.153198,578.714834,1424.802598,449.264283,859.260795,289.642991,618.825448,NaN

In [25]:
df['userid'].duplicated().any()

np.False_